'''
 Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

  /\ - AND, &, И, логическое умножение, конъюнкция,
   ¬ - NOT, !,~, НЕ, отрицание, инверсия, 
   \/ - OR, |, ИЛИ, логическое сложение, дизъюнкция
'''
result = True
def isValid(arr) :
    if not(arr[0] or arr[1] or arr[2]) != (not arr[0]) and (not arr[1]) and (not arr[2]):
        return False

arr = [[0,0,0],[0,0,1],[0,1,0],[0,1,1],[1,0,0],[1,0,1],[1,1,0],[1,1,1] ]

for el in arr:
    isValid(el)
print(result)
    